{"backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [11, 11], "activity_regularizer": null, "name": "conv2d_1", "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dtype": "float32", "activation": "linear", "filters": 96, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "strides": [4, 4], "batch_input_shape": [null, 224, 224, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batch_normalization_1", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [11, 11], "activity_regularizer": null, "name": "conv2d_2", "trainable": true, "activation": "linear", "padding": "valid", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batch_normalization_2", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_3", "trainable": true, "activation": "linear", "padding": "valid", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "filters": 384, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batch_normalization_3", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_4", "trainable": true, "activation": "linear", "padding": "valid", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "filters": 384, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batch_normalization_4", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_5", "trainable": true, "activation": "linear", "padding": "valid", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batch_normalization_5", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "units": 4096, "bias_regularizer": null, "activation": "linear", "trainable": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 150528]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.7, "name": "dropout_1", "seed": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batch_normalization_6", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_2", "units": 8192, "trainable": true, "activation": "linear", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.6, "name": "dropout_2", "seed": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batch_normalization_7", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_3", "units": 1000, "trainable": true, "activation": "linear", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.6, "name": "dropout_3", "seed": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batch_normalization_8", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "center": true, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null, "scale": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_4", "units": 3, "trainable": true, "activation": "linear", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_9", "trainable": true}}]}