{"config": [{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["block5_pool", 0, 0]], "name": "vgg16", "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block1_conv1", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block1_conv2", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "data_format": "channels_last", "name": "block1_pool", "pool_size": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D", "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 128, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block2_conv1", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 128, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block2_conv2", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "data_format": "channels_last", "name": "block2_pool", "pool_size": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D", "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 256, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block3_conv1", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 256, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block3_conv2", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 256, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block3_conv3", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "data_format": "channels_last", "name": "block3_pool", "pool_size": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D", "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 512, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block4_conv1", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 512, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block4_conv2", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 512, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block4_conv3", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "data_format": "channels_last", "name": "block4_pool", "pool_size": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D", "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 512, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block5_conv1", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 512, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block5_conv2", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 512, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "name": "block5_conv3", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D", "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "data_format": "channels_last", "name": "block5_pool", "pool_size": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D", "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}]}, "class_name": "Model"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "units": 8192, "use_bias": true, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1", "rate": 0.8}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "dense_2", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "units": 4096, "use_bias": true, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "name": "dense_3", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "units": 5, "use_bias": true, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential"}