{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Model", "config": {"name": "vgg16", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32"}, "inbound_nodes": []}, {"name": "block1_conv1", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block1_conv1", "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block1_conv2", "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block2_conv1", "filters": 128, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block2_conv2", "filters": 128, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block3_conv1", "filters": 256, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block3_conv2", "filters": 256, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block3_conv3", "filters": 256, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block4_conv1", "filters": 512, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block4_conv2", "filters": 512, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block4_conv3", "filters": 512, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block5_conv1", "filters": 512, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block5_conv2", "filters": 512, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "block5_conv3", "filters": 512, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["block5_pool", 0, 0]]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "units": 8192, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.8, "seed": null}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "units": 4096, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "use_bias": true, "bias_constraint": null, "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "name": "dense_3", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}}], "keras_version": "2.1.2"}